phoenix-rtos/plo/devices/flash-stm32xspi/flashdrv.c
/*
 * Phoenix-RTOS
 *
 * plo - operating system loader
 *
 * STM32 XSPI Flash driver
 *
 * Copyright 2020, 2025 Phoenix Systems
 * Author: Aleksander Kaminski, Jacek Maksymowicz
 *
 * This file is part of Phoenix-RTOS.
 *
 * %LICENSE%
 */

#include <hal/hal.h>
#include <lib/lib.h>
#include <devices/devs.h>

#include <board_config.h>

#include <hal/armv8m/stm32/n6/stm32n6.h>

#include "flash_params.h"


#define XSPI1_BASE     ((void *)0x58025000)
#define XSPI1_REG_BASE ((void *)0x90000000)
#define XSPI1_REG_SIZE (256 * 1024 * 1024)
#define XSPI1_IRQ      170
#define XSPI2_BASE     ((void *)0x5802a000)
#define XSPI2_REG_BASE ((void *)0x70000000)
#define XSPI2_REG_SIZE (256 * 1024 * 1024)
#define XSPI2_IRQ      171
#define XSPI3_BASE     ((void *)0x5802d000)
#define XSPI3_REG_BASE ((void *)0x80000000)
#define XSPI3_REG_SIZE (256 * 1024 * 1024)
#define XSPI3_IRQ      172
#define XSPIM_BASE     ((void *)0x5802B400)
#define FIFO_SIZE      64 /* Size of hardware FIFO */

#define MAX_PINS      22
#define N_CONTROLLERS 1


enum {
	ipclk_sel_hclk5 = 0x0,
	ipclk_sel_per_ck = 0x1,
	ipclk_sel_ic3_ck = 0x2,
	ipclk_sel_ic4_ck = 0x3,
};


enum xspi_regs {
	xspi_cr = 0x0,
	xspi_dcr1 = 0x2,
	xspi_dcr2,
	xspi_dcr3,
	xspi_dcr4,
	xspi_sr = 0x8,
	xspi_fcr,
	xspi_dlr = 0x10,
	xspi_ar = 0x12,
	xspi_dr = 0x14,
	xspi_psmkr = 0x20,
	xspi_psmar = 0x22,
	xspi_pir = 0x24,
	xspi_ccr = 0x40,
	xspi_tcr = 0x42,
	xspi_ir = 0x44,
	xspi_abr = 0x48,
	xspi_lptr = 0x4c,
	xspi_wpccr = 0x50,
	xspi_wptcr = 0x52,
	xspi_wpir = 0x54,
	xspi_wpabr = 0x58,
	xspi_wccr = 0x60,
	xspi_wtcr = 0x62,
	xspi_wir = 0x64,
	xspi_wabr = 0x68,
	xspi_hlcr = 0x80,
	xspi_calfcr = 0x84,
	xspi_calmr = 0x86,
	xspi_calsor = 0x88,
	xspi_calsir = 0x8a,
};


#define XSPI_SR_BUSY (1 << 5)
#define XSPI_SR_TOF  (1 << 4)
#define XSPI_SR_SMF  (1 << 3)
#define XSPI_SR_FTF  (1 << 2)
#define XSPI_SR_TCF  (1 << 1)
#define XSPI_SR_TEF  (1 << 0)

#define XSPI_CR_MODE_IWRITE   (0 << 28)
#define XSPI_CR_MODE_IREAD    (1 << 28)
#define XSPI_CR_MODE_AUTOPOLL (2 << 28)
#define XSPI_CR_MODE_MEMORY   (3 << 28)
#define XSPI_CR_MODE_MASK     (3 << 28)

#define XSPI_DCR1_MTYP_MICRON       (0 << 24)
#define XSPI_DCR1_MTYP_MACRONIX     (1 << 24)
#define XSPI_DCR1_MTYP_STANDARD     (2 << 24)
#define XSPI_DCR1_MTYP_MACRONIX_RAM (3 << 24)

typedef struct {
	u32 ccr;
	u32 tcr;
	u32 ir;
} flash_xspiSetup_t;

typedef struct {
	flash_xspiSetup_t reg;
	u32 addr;
	u32 dataLen;
	u8 hasAddr;
	u8 isRead;
} flash_opDefinition_t;


typedef struct {
	s16 port;
	s8 pin;
} flash_pin_t;


static const struct flash_ctrlParams {
	void *start;
	u32 size;
	volatile u32 *ctrl;
	struct {
		u16 sel; /* Clock mux (ipclk_xspi?sel) */
		u8 val;  /* Clock source (one of ipclk_sel_*) */
	} clksel;
	u16 divider_slow; /* Divider used for initialization - resulting clock must be under 50 MHz */
	u16 divider;      /* Divider used for normal operation - can be as fast as Flash can handle */
	u16 dev;
	u8 pin_af;
	flash_pin_t pins[MAX_PINS]; /* value < 0 signals end of list */
} controllerParams[N_CONTROLLERS] = {
	{
		.start = XSPI2_REG_BASE,
		.size = XSPI2_REG_SIZE,
		.clksel = { .sel = ipclk_xspi2sel, .val = ipclk_sel_ic3_ck },
		.divider_slow = 10,
		.divider = 4,
		.dev = dev_xspi2,
		.ctrl = XSPI2_BASE,
		.pin_af = 9,
		.pins = {
			{ dev_gpion, 0 },  /* XSPIM_P2_DQS0 */
			{ dev_gpion, 1 },  /* XSPIM_P2_NCS1 */
			{ dev_gpion, 2 },  /* XSPIM_P2_IO0 */
			{ dev_gpion, 3 },  /* XSPIM_P2_IO1 */
			{ dev_gpion, 4 },  /* XSPIM_P2_IO2 */
			{ dev_gpion, 5 },  /* XSPIM_P2_IO3 */
			{ dev_gpion, 6 },  /* XSPIM_P2_CLK */
			{ dev_gpion, 8 },  /* XSPIM_P2_IO4 */
			{ dev_gpion, 9 },  /* XSPIM_P2_IO5 */
			{ dev_gpion, 10 }, /* XSPIM_P2_IO6 */
			{ dev_gpion, 11 }, /* XSPIM_P2_IO7 */
			{ -1, -1 },
		},
	},
};


static struct flash_memParams {
	unsigned char device_id[6];
	int (*init_fn)(int minor);
	u32 size;
	flash_opParameters_t params;
	u32 memoryType;
	flash_xspiSetup_t read;
	flash_xspiSetup_t write;
	flash_xspiSetup_t erase;
	const flash_opDefinition_t *chipErase;
	const flash_opDefinition_t *status;
	const flash_opDefinition_t *wrEn;
	const flash_opDefinition_t *wrDis;
	const char *name;
} memParams[N_CONTROLLERS];


#define PHASE_TYPE_NO  0
#define PHASE_TYPE_S1  1
#define PHASE_TYPE_S2  2
#define PHASE_TYPE_S4  3
#define PHASE_TYPE_S8  4
#define PHASE_TYPE_D1  (1 | 8)
#define PHASE_TYPE_D2  (2 | 8)
#define PHASE_TYPE_D4  (3 | 8)
#define PHASE_TYPE_D8  (4 | 8)
#define PHASE_TYPE_D16 (5 | 8)

#define MAKE_CCR_VALUE(itype, atype, mtype, dtype, ilen, alen, mlen, dqs) ( \
		((PHASE_TYPE_##itype) << 0) | \
		((PHASE_TYPE_##atype) << 8) | \
		((PHASE_TYPE_##mtype) << 16) | \
		((PHASE_TYPE_##dtype) << 24) | \
		((((ilen) - 1) & 0x3) << 4) | \
		((((alen) - 1) & 0x3) << 12) | \
		((((mlen) - 1) & 0x3) << 20) | \
		(((dqs) & 0x1) << 29))

/* Definitions of default SPI Flash commands */

static const flash_opDefinition_t opDef_read_id = {
	.reg = {
		.ccr = MAKE_CCR_VALUE(S1, NO, NO, S1, 1, 0, 0, 0),
		.tcr = 0,
		.ir = 0x9f,
	},
	.dataLen = 6,
	.addr = 0,
	.hasAddr = 0,
	.isRead = 1,
};


static const flash_opDefinition_t opDef_enter_4byte = {
	.reg = {
		.ccr = MAKE_CCR_VALUE(S1, NO, NO, NO, 1, 0, 0, 0),
		.tcr = 0,
		.ir = 0xb7,
	},
	.dataLen = 0,
	.addr = 0,
	.hasAddr = 0,
	.isRead = 0,
};


static const flash_opDefinition_t opDef_read_status = {
	.reg = {
		.ccr = MAKE_CCR_VALUE(S1, NO, NO, S1, 1, 0, 0, 0),
		.tcr = 0,
		.ir = 0x05,
	},
	.dataLen = 1,
	.addr = 0,
	.hasAddr = 0,
	.isRead = 1,
};


static const flash_opDefinition_t opDef_write_enable = {
	.reg = {
		.ccr = MAKE_CCR_VALUE(S1, NO, NO, NO, 1, 0, 0, 0),
		.tcr = 0,
		.ir = 0x06,
	},
	.dataLen = 0,
	.addr = 0,
	.hasAddr = 0,
	.isRead = 0,
};


static const flash_opDefinition_t opDef_write_disable = {
	.reg = {
		.ccr = MAKE_CCR_VALUE(S1, NO, NO, NO, 1, 0, 0, 0),
		.tcr = 0,
		.ir = 0x04,
	},
	.dataLen = 0,
	.addr = 0,
	.hasAddr = 0,
	.isRead = 0,
};


static const flash_opDefinition_t opDef_chip_erase = {
	.reg = {
		.ccr = MAKE_CCR_VALUE(S1, NO, NO, NO, 1, 0, 0, 0),
		.tcr = 0,
		.ir = 0x60,
	},
	.dataLen = 0,
	.addr = 0,
	.hasAddr = 0,
	.isRead = 0,
};


/* Definitions of octal-SPI Flash commands */


static const flash_opDefinition_t opDef_octa_read_status = {
	.reg = {
		.ccr = MAKE_CCR_VALUE(D8, D8, NO, S8, 2, 4, 0, 1),
		.tcr = 4,
		.ir = 0x05fa,
	},
	.dataLen = 2,
	.addr = 0,
	.hasAddr = 1,
	.isRead = 1,
};


static const flash_opDefinition_t opDef_octa_write_enable = {
	.reg = {
		.ccr = MAKE_CCR_VALUE(D8, NO, NO, NO, 2, 0, 0, 0),
		.tcr = 0,
		.ir = 0x06f9,
	},
	.dataLen = 0,
	.addr = 0,
	.hasAddr = 0,
	.isRead = 0,
};


static const flash_opDefinition_t opDef_octa_write_disable = {
	.reg = {
		.ccr = MAKE_CCR_VALUE(D8, NO, NO, NO, 2, 0, 0, 0),
		.tcr = 0,
		.ir = 0x04fb,
	},
	.dataLen = 0,
	.addr = 0,
	.hasAddr = 0,
	.isRead = 0,
};


static const flash_opDefinition_t opDef_octa_chip_erase = {
	.reg = {
		.ccr = MAKE_CCR_VALUE(D8, NO, NO, NO, 2, 0, 0, 0),
		.tcr = 0,
		.ir = 0x609f,
	},
	.dataLen = 0,
	.addr = 0,
	.hasAddr = 0,
	.isRead = 0,
};


static const u32 opModeToCCR[operation_io_types] = {
	[operation_io_111] = MAKE_CCR_VALUE(S1, S1, S1, S1, 1, 1, 1, 0),
	[operation_io_112] = MAKE_CCR_VALUE(S1, S1, S1, S2, 1, 1, 1, 0),
	[operation_io_122] = MAKE_CCR_VALUE(S1, S2, S2, S2, 1, 1, 1, 0),
	[operation_io_114] = MAKE_CCR_VALUE(S1, S1, S1, S4, 1, 1, 1, 0),
	[operation_io_144] = MAKE_CCR_VALUE(S1, S4, S4, S4, 1, 1, 1, 0),
	[operation_io_222] = MAKE_CCR_VALUE(S2, S2, S2, S2, 1, 1, 1, 0),
	[operation_io_444] = MAKE_CCR_VALUE(S4, S4, S4, S4, 1, 1, 1, 0),
	[operation_io_444d] = MAKE_CCR_VALUE(D4, D4, D4, D4, 1, 1, 1, 1),
	[operation_io_888] = MAKE_CCR_VALUE(S8, S8, S8, S8, 1, 1, 1, 0),
	[operation_io_888d] = MAKE_CCR_VALUE(D8, D8, D8, D8, 1, 1, 1, 1),
};


