phoenix-rtos/plo/devices/flash-stm32xspi/flashdrv.c
static u32 flashdrv_makeCCRValue(
		u8 opMode,
		u8 opcodeType,
		u8 addrBytes,
		u8 modeBytes,
		u8 hasData)
{
	u32 ccr = opModeToCCR[opMode];
	if (opcodeType != flash_opcode_8b) {
		ccr |= 1 << 4; /* 2-byte instruction */
	}

	if (addrBytes != 0) {
		ccr |= (addrBytes - 1) << 12;
	}
	else {
		ccr &= ~(0x7 << 8); /* No address */
	}

	if (modeBytes != 0) {
		ccr |= (modeBytes - 1) << 20;
	}
	else {
		ccr &= ~(0x7 << 16); /* No mode bytes */
	}

	if (hasData == 0) {
		ccr &= ~(0x7 << 24); /* No data bytes */
	}

	return ccr;
}


static u32 flashdrv_makeIRValue(u8 opcodeType, u16 opcode)
{
	switch (opcodeType) {
		case flash_opcode_8b_repeat:
			return ((u32)opcode << 8) | opcode;

		case flash_opcode_8b_inverse:
			return ((u32)opcode << 8) | (~opcode & 0xff);

		default:
			return opcode;
	}
}


static u32 flashdrv_changeCtrlMode(unsigned int minor, u32 new_mode)
{
	const struct flash_ctrlParams *p = &controllerParams[minor];
	struct flash_memParams *mp = &memParams[minor];
	u32 prev_mode, v;

	v = *(p->ctrl + xspi_cr);
	prev_mode = (v & XSPI_CR_MODE_MASK);
	if (prev_mode == new_mode) {
		return prev_mode;
	}

	if (prev_mode == XSPI_CR_MODE_MEMORY) {
		hal_cpuDataMemoryBarrier();
		*(p->ctrl + xspi_cr) = v | (1 << 1); /* Abort memory-mapped read */
		while ((*(p->ctrl + xspi_sr) & XSPI_SR_BUSY) != 0) {
			/* Wait for controller to become ready */
		}

		*(p->ctrl + xspi_fcr) = XSPI_SR_TCF;
	}

	v &= ~XSPI_CR_MODE_MASK;
	v |= new_mode;
	*(p->ctrl + xspi_cr) = v;
	while ((*(p->ctrl + xspi_sr) & XSPI_SR_BUSY) != 0) {
		/* Wait for controller to become ready */
	}

	if (new_mode == XSPI_CR_MODE_MEMORY) {
		*(p->ctrl + xspi_ccr) = mp->read.ccr;
		*(p->ctrl + xspi_tcr) = mp->read.tcr;
		*(p->ctrl + xspi_ir) = mp->read.ir;
		hal_cpuDataMemoryBarrier();
	}

	return prev_mode;
}


static void flashdrv_performOp(unsigned int minor, const flash_opDefinition_t *opDef, unsigned char *data)
{
	const struct flash_ctrlParams *p = &controllerParams[minor];
	int i = 0, j = 0;
	u32 status;

	flashdrv_changeCtrlMode(minor, (opDef->isRead != 0) ? XSPI_CR_MODE_IREAD : XSPI_CR_MODE_IWRITE);
	if (opDef->dataLen != 0) {
		*(p->ctrl + xspi_dlr) = opDef->dataLen - 1;
	}

	*(p->ctrl + xspi_ccr) = opDef->reg.ccr;
	*(p->ctrl + xspi_tcr) = opDef->reg.tcr;
	/* If indirect read mode and no address, this write triggers the operation */
	*(p->ctrl + xspi_ir) = opDef->reg.ir;
	if (opDef->hasAddr != 0) {
		/* If indirect read mode with address, this write triggers the operation */
		*(p->ctrl + xspi_ar) = opDef->addr;
	}

	while (i < opDef->dataLen) {
		do {
			status = *(p->ctrl + xspi_sr);
		} while ((status & (XSPI_SR_FTF | XSPI_SR_TCF)) == 0);

		if (opDef->isRead != 0) {
			j = FIFO_SIZE - ((status >> 8) & 0x7f);
			for (; j < FIFO_SIZE && (i < opDef->dataLen); j++, i++) {
				/* This controller allows byte and halfword reads from the XSPI_DR register */
				data[i] = *(volatile u8 *)(p->ctrl + xspi_dr);
			}
		}
		else {
			j = (status >> 8) & 0x7f;
			/* In indirect write mode, writing data triggers the operation */
			for (; j < FIFO_SIZE && (i < opDef->dataLen); j++, i++) {
				/* This controller allows byte and halfword writes to the XSPI_DR register */
				*(volatile u8 *)(p->ctrl + xspi_dr) = data[i];
			}
		}
	}

	while ((*(p->ctrl + xspi_sr) & XSPI_SR_TCF) == 0) {
		/* Wait for transfer completion */
	}

	*(p->ctrl + xspi_fcr) = XSPI_SR_TCF;
}


static int flashdrv_waitForWriteCompletion(unsigned int minor, const flash_opDefinition_t *opDef, u32 timeout)
{
	int ret = 0;
	const struct flash_ctrlParams *p = &controllerParams[minor];
	time_t time_start = hal_timerGet();

	flashdrv_changeCtrlMode(minor, XSPI_CR_MODE_AUTOPOLL);
	*(p->ctrl + xspi_psmkr) = 0x01; /* Check bit 0 */
	*(p->ctrl + xspi_psmar) = 0x00; /* Check until it's cleared */
	*(p->ctrl + xspi_pir) = 0x10;
	*(p->ctrl + xspi_dlr) = opDef->dataLen - 1;
	*(p->ctrl + xspi_ccr) = opDef->reg.ccr;
	*(p->ctrl + xspi_tcr) = opDef->reg.tcr;
	*(p->ctrl + xspi_ir) = opDef->reg.ir;
	if (opDef->hasAddr != 0) {
		*(p->ctrl + xspi_ar) = opDef->addr;
	}

	while (1) {
		if ((*(p->ctrl + xspi_sr) & XSPI_SR_SMF) != 0) {
			break;
		}

		if (hal_timerGet() - time_start > timeout) {
			*(p->ctrl + xspi_cr) |= (1 << 1); /* Abort auto-polling */
			ret = -ETIME;
			break;
		}
	}
	*(p->ctrl + xspi_fcr) = XSPI_SR_SMF;
	return ret;
}


static int flashdrv_writeEnable(unsigned int minor, int enable)
{
	u8 status;
	const flash_opDefinition_t *opDef = enable ? memParams[minor].wrEn : memParams[minor].wrDis;
	unsigned retries = 10;
	enable = (enable != 0) ? 1 : 0;

	/* Set flag and verify until it's set - required according to Macronix datasheet */
	do {
		if (retries == 0) {
			return -EIO;
		}

		retries--;
		flashdrv_performOp(minor, opDef, NULL);
		flashdrv_performOp(minor, memParams[minor].status, &status);
	} while (((status >> 1) & 1) != enable);

	return 0;
}


/* Perform a write-like operation (program or erase) */
static ssize_t flashdrv_performWriteOp(
		unsigned int minor,
		const flash_opDefinition_t *opDef,
		const void *data,
		u32 timeout)
{
	if (flashdrv_writeEnable(minor, 1) < 0) {
		return -EIO;
	}

	flashdrv_performOp(minor, opDef, (void *)data);
	return flashdrv_waitForWriteCompletion(minor, memParams[minor].status, timeout);
}


/* Puts controller into a mode where SFDP data can be accessed within the address space.
 * Returns pointer to SFDP data. */
static const u32 *flashdrv_mountSfdp(int minor)
{
	const struct flash_ctrlParams *p = &controllerParams[minor];
	struct flash_memParams *mp = &memParams[minor];

	mp->read.ccr = MAKE_CCR_VALUE(S1, S1, NO, S1, 1, 3, 0, 0);
	mp->read.tcr = 8;   /* 8 dummy cycles, no sample shifting */
	mp->read.ir = 0x5a; /* Set read command to 0x5a (READ SERIAL FLASH DISCOVERY PARAMETER) */
	flashdrv_changeCtrlMode(minor, XSPI_CR_MODE_MEMORY);
	return p->start;
}


static int flashdrv_detectGeneric(int minor, flash_opParameters_t *res, unsigned char *device_id)
{
	return flashdrv_parseSfdp(flashdrv_mountSfdp(minor), res, 0);
}


static u8 flashdrv_modeCyclesToBits(u8 readIoType, u8 cycles)
{
	switch (readIoType) {
		case operation_io_888: /* Fall-through */
		case operation_io_888d:
			return cycles * 8;

		case operation_io_144: /* Fall-through */
		case operation_io_444: /* Fall-through */
		case operation_io_444d:
			return cycles * 4;

