phoenix-rtos/plo/devices/flash-stm32xspi/flashdrv.c
		case operation_io_122: /* Fall-through */
		case operation_io_222:
			return cycles * 2;

		default:
			return cycles;
	}
}


static void flashdrv_fillOperations(struct flash_memParams *mp)
{
	flash_opParameters_t *fp = &mp->params;
	u32 readModeBytes = 0, v;

	if (fp->readModeCyc != 0) {
		v = flashdrv_modeCyclesToBits(fp->readIoType, fp->readModeCyc);
		if ((v % 8) != 0 || ((v / 8) > 4)) {
			/* This controller only supports mode bytes (not bits). If number of bits is % 8 != 0, treat them
			 * as if they were dummy cycles.
			 * This is not entirely correct, but in this case it's likely that the data in SFDP is inaccurate anyway
			 * (manufacturer counted some dummy cycles as "mode cycles" and Flash doesn't care about mode data). */
			fp->readDummy += fp->readModeCyc;
			fp->readModeCyc = 0;
		}
		else {
			readModeBytes = v / 8;
		}
	}

	mp->read.ccr = flashdrv_makeCCRValue(
			fp->readIoType, fp->opcodeType, (fp->addrMode == ADDRMODE_3B) ? 3 : 4, readModeBytes, 1);
	mp->read.tcr = fp->readDummy;
	mp->read.ir = flashdrv_makeIRValue(fp->opcodeType, fp->readOpcode);

	mp->write.ccr = flashdrv_makeCCRValue(
			fp->writeIoType, fp->opcodeType, (fp->addrMode == ADDRMODE_3B) ? 3 : 4, 0, 1);
	mp->write.tcr = fp->writeDummy;
	mp->write.ir = flashdrv_makeIRValue(fp->opcodeType, fp->writeOpcode);

	mp->erase.ccr = flashdrv_makeCCRValue(
			fp->writeIoType, fp->opcodeType, (fp->addrMode == ADDRMODE_3B) ? 3 : 4, 0, 0);
	mp->erase.tcr = 0;
	mp->erase.ir = flashdrv_makeIRValue(fp->opcodeType, fp->eraseOpcode);
}


static int flashdrv_initGeneric(int minor)
{
	struct flash_memParams *mp = &memParams[minor];
	int ret;

	if (mp->params.addrMode == ADDRMODE_4BO) {
		ret = flashdrv_performWriteOp(minor, &opDef_enter_4byte, NULL, 1000);
		if (ret < 0) {
			return ret;
		}
	}

	flashdrv_fillOperations(mp);
	return 0;
}


static int flashdrv_detectMacronixOcta(int minor, flash_opParameters_t *res, unsigned char *device_id)
{
	int ret = flashdrv_parseSfdp(flashdrv_mountSfdp(minor), res, 0);
	if (ret < 0) {
		return ret;
	}

	/* This chip's SFDP data is almost useless because it only includes 3-byte address versions of commands.
	 * We need to input the 4-byte versions of each command from the datasheet. */
	res->opcodeType = flash_opcode_8b_inverse;
	res->readIoType = operation_io_888d;
	res->readOpcode = 0xee; /* OCTA DTR Read */
	res->readDummy = 20;
	res->readModeCyc = 0;
	res->writeIoType = operation_io_888d;
	res->writeOpcode = 0x12; /* Page program 4B */
	res->writeDummy = 0;
	res->addrMode = ADDRMODE_4B;
	res->eraseOpcode = 0xdc;
	res->log_eraseSize = 16;
	return 0;
}


static int flashdrv_initMacronixOcta(int minor)
{
	static const flash_opDefinition_t opDef_writeWRCR2 = {
		.reg = {
			.ccr = MAKE_CCR_VALUE(S1, S1, NO, S1, 1, 4, 0, 0),
			.tcr = 0,
			.ir = 0x72,
		},
		.dataLen = 1,
		.addr = 0,
		.hasAddr = 1,
		.isRead = 0,
	};

	struct flash_memParams *mp = &memParams[minor];
	u8 value = 0x02; /* Value to put Flash into DTR mode */
	int ret;

	if (flashdrv_writeEnable(minor, 1) < 0) {
		return -EIO;
	}

	flashdrv_performOp(minor, &opDef_writeWRCR2, &value);
	ret = flashdrv_waitForWriteCompletion(minor, &opDef_octa_read_status, 1000);
	if (ret < 0) {
		return ret;
	}

	flashdrv_fillOperations(mp);
	mp->chipErase = &opDef_octa_chip_erase;
	mp->status = &opDef_octa_read_status;
	mp->wrEn = &opDef_octa_write_enable;
	mp->wrDis = &opDef_octa_write_disable;
	mp->memoryType = XSPI_DCR1_MTYP_MACRONIX;
	return 0;
}


static int flashdrv_detectFlashType(unsigned int minor, flash_opParameters_t *res)
{
	flashdrv_fillDefaultParams(res);
	unsigned char *device_id = memParams[minor].device_id;
	flashdrv_performOp(minor, &opDef_read_id, device_id);

	if ((device_id[0] == 0xc2) && (device_id[1] == 0x80)) {
		memParams[minor].name = "Macronix";
		memParams[minor].init_fn = flashdrv_initMacronixOcta;
		return flashdrv_detectMacronixOcta(minor, res, device_id);
	}

	memParams[minor].name = "generic";
	memParams[minor].init_fn = flashdrv_initGeneric;
	return flashdrv_detectGeneric(minor, res, device_id);
}


static int flashdrv_isValidAddress(unsigned int minor, u32 off, size_t size)
{
	size_t fsize = memParams[minor].size;
	if ((off < fsize) && ((off + size) <= fsize)) {
		return 1;
	}

	return 0;
}


static int flashdrv_isValidMinor(unsigned int minor)
{
	return minor < N_CONTROLLERS ? 1 : 0;
}


static void flashdrv_initPins(const struct flash_ctrlParams *p)
{
	unsigned int i;
	for (i = 0; i < MAX_PINS; i++) {
		if (p->pins[i].port == -1) {
			break;
		}

		_stm32_gpioConfig(p->pins[i].port, p->pins[i].pin, gpio_mode_af, p->pin_af, gpio_otype_pp, gpio_ospeed_vhi, gpio_pupd_nopull);
	}
}


/* Below are functions for device's public interface */


static int flashdrv_sync(unsigned int minor)
{
	if (flashdrv_isValidMinor(minor) == 0) {
		return -EINVAL;
	}

	/* TODO: it may be faster to clear the whole DCache instead of doing it by address
	 * or we can disable caching of this region using MPU */
	hal_cpuInvCache(hal_cpuDCache, (addr_t)controllerParams[minor].start, memParams[minor].size);
	return EOK;
}


static ssize_t flashdrv_read(unsigned int minor, addr_t offs, void *buff, size_t len, time_t timeout)
{
	(void)timeout;
	if ((flashdrv_isValidMinor(minor) == 0) || (flashdrv_isValidAddress(minor, offs, len) == 0)) {
		return -EINVAL;
	}

	hal_memcpy(buff, controllerParams[minor].start + offs, len);
	return (ssize_t)len;
}


static ssize_t flashdrv_write_internal(unsigned int minor, addr_t offs, const void *buff, size_t len)
{
	flash_opDefinition_t opDef;
	const struct flash_memParams *mp;
	size_t remaining = len;
	u32 page_remaining, unaligned_end = 0;
	ssize_t ret;
	u8 tmp[2];

	/* In DTR mode both offset and length must be aligned to 2 bytes */
	mp = &memParams[minor];
	opDef.reg = mp->write;
	opDef.hasAddr = 1;
	opDef.isRead = 0;
	if ((offs % 2) != 0) {
		tmp[0] = 0xff;
		tmp[1] = ((const u8 *)buff)[0];
		opDef.addr = offs - 1;
		opDef.dataLen = 2;
		ret = flashdrv_performWriteOp(minor, &opDef, tmp, 1000);
		if (ret < 0) {
			return ret;
		}

		offs++;
		buff++;
		remaining--;
	}

	unaligned_end = remaining % 2;
	remaining -= unaligned_end;

