phoenix-rtos/plo/devices/flash-stm32xspi/flashdrv.c
	while (remaining > 0) {
		page_remaining = 256 - (offs % 256);
		if (page_remaining > remaining) {
			page_remaining = remaining;
		}

		opDef.addr = offs;
		opDef.dataLen = page_remaining;
		ret = flashdrv_performWriteOp(minor, &opDef, buff, 1000);
		if (ret < 0) {
			return ret;
		}

		offs += page_remaining;
		buff += page_remaining;
		remaining -= page_remaining;
	}

	if (unaligned_end != 0) {
		tmp[0] = ((const u8 *)buff)[0];
		tmp[1] = 0xff;
		opDef.addr = offs;
		opDef.dataLen = 2;
		ret = flashdrv_performWriteOp(minor, &opDef, tmp, 1000);
		if (ret < 0) {
			return ret;
		}
	}

	return (ssize_t)len;
}


static ssize_t flashdrv_write(unsigned int minor, addr_t offs, const void *buff, size_t len)
{
	ssize_t ret;
	u32 prev_mode;
	if ((flashdrv_isValidMinor(minor) == 0) || (flashdrv_isValidAddress(minor, offs, len) == 0)) {
		return -EINVAL;
	}

	if (len == 0) {
		return 0;
	}

	prev_mode = flashdrv_changeCtrlMode(minor, XSPI_CR_MODE_IWRITE);
	ret = flashdrv_write_internal(minor, offs, buff, len);
	flashdrv_changeCtrlMode(minor, prev_mode);
	return ret;
}


static ssize_t flashdrv_erase_internal(unsigned int minor, addr_t offs, size_t len)
{
	flash_opDefinition_t op;
	const struct flash_memParams *mp;
	u32 eraseSize;
	mp = &memParams[minor];
	int ret = 0;
	if (len == (size_t)-1) {
		ret = flashdrv_performWriteOp(minor, mp->chipErase, NULL, mp->params.eraseChipTimeout);
		return (ret < 0) ? ret : (ssize_t)memParams[minor].size;
	}
	else {
		eraseSize = 1 << mp->params.log_eraseSize;
		if ((offs & (eraseSize - 1)) != 0 || (len & (eraseSize - 1)) != 0) {
			return -EINVAL;
		}

		op.reg = mp->erase;
		op.hasAddr = 1;
		op.isRead = 0;
		op.dataLen = 0;
		for (; len != offs; offs += eraseSize) {
			op.addr = offs;
			ret = flashdrv_performWriteOp(minor, &op, NULL, mp->params.eraseBlockTimeout);
			if (ret < 0) {
				return ret;
			}
		}

		return (ssize_t)len;
	}
}


static ssize_t flashdrv_erase(unsigned int minor, addr_t offs, size_t len, unsigned int flags)
{
	ssize_t ret;
	u32 prev_mode;

	(void)flags;
	if (flashdrv_isValidMinor(minor) == 0) {
		return -EINVAL;
	}

	if ((len != (size_t)-1) && (flashdrv_isValidAddress(minor, offs, len) == 0)) {
		return -EINVAL;
	}

	prev_mode = flashdrv_changeCtrlMode(minor, XSPI_CR_MODE_IWRITE);
	ret = flashdrv_erase_internal(minor, offs, len);
	flashdrv_sync(minor);
	flashdrv_changeCtrlMode(minor, prev_mode);
	return ret;
}


static int flashdrv_done(unsigned int minor)
{
	if (flashdrv_isValidMinor(minor) == 0) {
		return -EINVAL;
	}

	return EOK;
}


static int flashdrv_map(unsigned int minor, addr_t addr, size_t sz, int mode, addr_t memaddr, size_t memsz, int memmode, addr_t *a)
{
	size_t fSz, ctrlSz;
	addr_t fStart;

	if (flashdrv_isValidMinor(minor) == 0) {
		return -EINVAL;
	}

	fStart = (addr_t)controllerParams[minor].start;
	ctrlSz = controllerParams[minor].size;
	fSz = memParams[minor].size;
	*a = fStart;

	/* Check if region is located on flash */
	if ((addr + sz) >= fSz) {
		return -EINVAL;
	}

	/* Check if flash is mappable to map region */
	if (fStart <= memaddr && (fStart + ctrlSz) >= (memaddr + memsz)) {
		return dev_isMappable;
	}

	/* Device mode cannot be higher than map mode to copy data */
	if ((mode & memmode) != mode) {
		return -EINVAL;
	}

	/* Data can be copied from device to map */
	return dev_isNotMappable;
}


static int flashdrv_init(unsigned int minor)
{
	int ret;
	u32 v;
	const struct flash_ctrlParams *p;
	struct flash_memParams *mp;
	flash_opParameters_t *fp;

	if (flashdrv_isValidMinor(minor) == 0) {
		return -EINVAL;
	}

	p = &controllerParams[minor];
	mp = &memParams[minor];
	fp = &mp->params;

	mp->chipErase = &opDef_chip_erase;
	mp->status = &opDef_read_status;
	mp->wrEn = &opDef_write_enable;
	mp->wrDis = &opDef_write_disable;
	flashdrv_initPins(p);

	_stm32_rccSetIPClk(p->clksel.sel, p->clksel.val);
	_stm32_rccSetDevClock(p->dev, 1);
	_stm32_rccSetDevClock(dev_xspim, 1);

	*(p->ctrl + xspi_cr) = 0; /* Disable controller */
	hal_cpuDataSyncBarrier();

	*(p->ctrl + xspi_cr) =
			(0 << 24) |          /* Use Chip select 1 */
			(1 << 22) |          /* Stop auto-polling on match */
			(3 << 8) |           /* FIFO threshold = 4 bytes */
			(1 << 3);            /* Enable timeout for memory-mapped mode */
	*(p->ctrl + xspi_lptr) = 64; /* Timeout for memory-mapped mode */
	*(p->ctrl + xspi_cr) |= 1;   /* Enable controller */

	while ((*(p->ctrl + xspi_sr) & XSPI_SR_BUSY) != 0) {
		/* Wait for controller to become ready */
	}

	mp->memoryType = XSPI_DCR1_MTYP_STANDARD;
	*(p->ctrl + xspi_dcr1) =
			mp->memoryType | /* Standard memory mode */
			(23 << 16) |     /* 16 MB size */
			(0 << 8) |       /* Chip-select high for at least 1 cycle */
			(0 << 1);        /* Free-running clock disable */
	*(p->ctrl + xspi_dcr2) =
			(0 << 16) |                     /* Wrapped reads not supported */
			((p->divider_slow - 1) & 0xff); /* Clock prescaler */
	*(p->ctrl + xspi_dcr3) = 0;
	*(p->ctrl + xspi_dcr4) = 0;

	/* Disable writing in memory mapped mode */
	*(p->ctrl + xspi_wccr) = 0;
	*(p->ctrl + xspi_wtcr) = 0;
	*(p->ctrl + xspi_wir) = 0;

	while ((*(p->ctrl + xspi_sr) & XSPI_SR_BUSY) != 0) {
		/* Wait for controller to become ready */
	}

	/* Read Flash memory details (JEDEC ID and SFDP)
	 * Some chips require SFDP to be read at lower speed. */
	ret = flashdrv_detectFlashType(minor, fp);
	if (ret < 0) {
		return ret;
	}

	flashdrv_changeCtrlMode(minor, XSPI_CR_MODE_IWRITE);

	if (mp->init_fn != NULL) {
		ret = mp->init_fn(minor);
		if (ret < 0) {
			return ret;
		}
	}

	/* Configure higher clocks */
	*(p->ctrl + xspi_dcr2) =
			(0 << 16) |                /* Wrapped reads not supported */
			((p->divider - 1) & 0xff); /* Clock prescaler */

	if (fp->log_chipSize <= 31) {
		mp->size = 1 << fp->log_chipSize;
	}
	else {
		fp->log_chipSize = 31;
		mp->size = 1 << 31;
	}

	/* Limit size of the device to what's accessible */
	if (mp->size > controllerParams[minor].size) {
		mp->size = controllerParams[minor].size;
	}

	if ((fp->addrMode == ADDRMODE_3B) && (mp->size > (1 << 24))) {
		/* If flash was not fully recognized, it may be larger than 16 MB, but we don't know
		 * how to put it into 4-byte addressing mode - so it's limited to 16 MB */
		mp->size = (1 << 24);
	}

	/* Set new memory size into DCR1 */
	v = *(p->ctrl + xspi_dcr1);
	v &= ~((0x1f << 16) | (0x7 << 24));
	v |= ((fp->log_chipSize - 1) << 16) | mp->memoryType;
	*(p->ctrl + xspi_dcr1) = v;

	flashdrv_changeCtrlMode(minor, XSPI_CR_MODE_MEMORY);
	flashdrv_sync(minor);

	lib_printf("\ndev/flash: Configured %s %dMB NOR flash(%d.%d)",
			mp->name,
			mp->size >> 20,
			DEV_STORAGE,
			minor);

	return EOK;
}


__attribute__((constructor)) static void flashdrv_reg(void)
{
	static const dev_ops_t opsFlashSTM32_XSPI = {
		.read = flashdrv_read,
		.write = flashdrv_write,
		.erase = flashdrv_erase,
		.sync = flashdrv_sync,
		.map = flashdrv_map,
	};

	static const dev_t devFlashSTM32_XSPI = {
		.name = "flash-stm32xspi",
		.init = flashdrv_init,
		.done = flashdrv_done,
		.ops = &opsFlashSTM32_XSPI,
	};

	devs_register(DEV_STORAGE, N_CONTROLLERS, &devFlashSTM32_XSPI);
}
